In [1]:
import numpy as np
import pandas as pd

In [2]:
car_names = pd.Series(["BMW", "Toyota", "Nissan", "Saab", "Suzuki","Audi"]).to_frame(name= "Name")
car_units_sold = pd.Series([23,43,12,34,56,21]).to_frame(name= "Units Sold")
car_price_per_unit = pd.Series([25000,34000,43000,12000,13200,23120]).to_frame(name= "Price Per Unit")

In [3]:
car_sales = pd.concat([car_names,car_units_sold,car_price_per_unit], axis=1)
car_sales

     Name  Units Sold  Price Per Unit
0     BMW          23           25000
1  Toyota          43           34000
2  Nissan          12           43000
3    Saab          34           12000
4  Suzuki          56           13200
5    Audi          21           23120

In [4]:
total = car_sales["Units Sold"] * car_sales["Price Per Unit"]
total.to_frame("Total")
car_sales["Total"] = total

In [5]:
car_sales

     Name  Units Sold  Price Per Unit    Total
0     BMW          23           25000   575000
1  Toyota          43           34000  1462000
2  Nissan          12           43000   516000
3    Saab          34           12000   408000
4  Suzuki          56           13200   739200
5    Audi          21           23120   485520